In [11]:
import numpy as np
import pandas as pd

df = pd.read_csv('data.csv', encoding = 'unicode_escape')
df.head()

,job_title,hh_title,age,salary,exp. period,title of exp.
0,data analyst,Data analyst,22.0,NaN,2.67,Data Analyst
1,data analyst,Data Analyst,21.0,NaN,0.83,Junior Data Analyst
2,data analyst,Data Analyst,30.0,NaN,7.50,Data Analyst
3,data analyst,Data Analyst,24.0,NaN,4.92,Data Analyst
4,data analyst,Data Analyst,27.0,450000.0,3.25,Business Intelligence Analyst

In [17]:
sdf = df.loc[:,['job_title', 'age', 'salary', 'exp. period']]
sdf

        job_title   age    salary  exp. period
0    data analyst  22.0       NaN         2.67
1    data analyst  21.0       NaN         0.83
2    data analyst  30.0       NaN         7.50
3    data analyst  24.0       NaN         4.92
4    data analyst  27.0  450000.0         3.25
..            ...   ...       ...          ...
995           sql  51.0       NaN        25.42
996           sql  22.0       NaN         1.58
997           sql  42.0       NaN         9.33
998           sql   NaN       NaN        16.08
999           sql  19.0       NaN         0.33

[1000 rows x 4 columns]

In [36]:
clean_sdf = sdf.dropna()
clean_sdf

        job_title   age     salary  exp. period
4    data analyst  27.0   450000.0         3.25
11   data analyst  25.0   860000.0         2.92
12   data analyst  28.0   950000.0         7.25
15   data analyst  29.0   500000.0         6.75
21   data analyst  22.0   500000.0         3.33
..            ...   ...        ...          ...
989           sql  56.0      860.0        15.25
990           sql  32.0   645000.0        10.67
991           sql  28.0   200000.0         6.58
992           sql  38.0   500000.0        11.42
994           sql  29.0  1505000.0         0.58

[274 rows x 4 columns]

In [26]:
X = clean_sdf.drop('job_title', axis = 1)
y = clean_sdf['job_title']

In [27]:
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB

In [28]:
Xtrain, Xtest, ytrain, ytest = train_test_split(X, y, train_size = 0.8, stratify=y)

In [29]:
model = GaussianNB()
model.fit(Xtrain, ytrain)

GaussianNB()

In [31]:
y_model = model.predict(Xtest)

In [32]:
from sklearn.metrics import accuracy_score
accuracy_score(ytest, y_model)

0.4909090909090909

In [33]:
from sklearn.model_selection import cross_val_score

In [34]:
scores = cross_val_score(model, X, y, cv = 10)
scores

array([0.5       , 0.46428571, 0.46428571, 0.5       , 0.44444444,
       0.48148148, 0.44444444, 0.48148148, 0.44444444, 0.48148148])

In [35]:
scores.mean()

0.47063492063492063

In [37]:
from sklearn.neighbors import KNeighborsClassifier

In [38]:
model_2 = KNeighborsClassifier(n_neighbors = 3)

In [39]:
model_2.fit(Xtrain, ytrain)

KNeighborsClassifier(n_neighbors=3)

In [40]:
y2_model = model_2.predict(Xtest)
accuracy_score(ytest, y2_model)

0.8909090909090909

In [41]:
scores_2 = cross_val_score(model_2, X, y, cv = 10)
scores_2

array([0.96428571, 0.92857143, 0.96428571, 0.92857143, 0.96296296,
       0.92592593, 0.96296296, 0.92592593, 0.96296296, 0.88888889])

In [42]:
scores_2.mean()

0.9415343915343917